Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
dense_1_input (InputLayer)      [(None, 4096)]       0                                            
__________________________________________________________________________________________________
dense_input (InputLayer)        [(None, 7265)]       0                                            
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 1024)         4195328     dense_1_input[0][0]              
__________________________________________________________________________________________________
dense (Dense)                   (None, 1024)         7440384     dense_input[0][0]                
__________________________________________________________________________________________________
concatenate (Concatenate)       (None, 2048)         0           dense_1[0][0]                    
                                                                 dense[0][0]                      
__________________________________________________________________________________________________
dropout (Dropout)               (None, 2048)         0           concatenate[0][0]                
__________________________________________________________________________________________________
dense_2 (Dense)                 (None, 2048)         4196352     dropout[0][0]                    
__________________________________________________________________________________________________
dense_3 (Dense)                 (None, 1024)         2098176     dense_2[0][0]                    
__________________________________________________________________________________________________
dense_4 (Dense)                 (None, 1000)         1025000     dense_3[0][0]                    
==================================================================================================
Total params: 18,955,240
Trainable params: 18,955,240
Non-trainable params: 0
__________________________________________________________________________________________________
