Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, None)]       0                                            
__________________________________________________________________________________________________
embedding (Embedding)           (None, None, 300)    4429500     input_1[0][0]                    
__________________________________________________________________________________________________
lstm (LSTM)                     [(None, None, 512),  1665024     embedding[0][0]                  
__________________________________________________________________________________________________
lstm_1 (LSTM)                   [(None, 512), (None, 2099200     lstm[0][0]                       
__________________________________________________________________________________________________
input_2 (InputLayer)            [(None, 4096)]       0                                            
__________________________________________________________________________________________________
concatenate (Concatenate)       (None, 2048)         0           lstm[0][2]                       
                                                                 lstm[0][1]                       
                                                                 lstm_1[0][2]                     
                                                                 lstm_1[0][1]                     
__________________________________________________________________________________________________
batch_normalization (BatchNorma (None, 4096)         16384       input_2[0][0]                    
__________________________________________________________________________________________________
dense (Dense)                   (None, 1024)         2098176     concatenate[0][0]                
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 1024)         4195328     batch_normalization[0][0]        
__________________________________________________________________________________________________
multiply (Multiply)             (None, 1024)         0           dense[0][0]                      
                                                                 dense_1[0][0]                    
__________________________________________________________________________________________________
dropout (Dropout)               (None, 1024)         0           multiply[0][0]                   
__________________________________________________________________________________________________
dense_2 (Dense)                 (None, 1000)         1025000     dropout[0][0]                    
__________________________________________________________________________________________________
dropout_1 (Dropout)             (None, 1000)         0           dense_2[0][0]                    
__________________________________________________________________________________________________
dense_3 (Dense)                 (None, 1000)         1001000     dropout_1[0][0]                  
==================================================================================================
Total params: 16,529,612
Trainable params: 12,091,920
Non-trainable params: 4,437,692
__________________________________________________________________________________________________
