Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
dense_input (InputLayer)        [(None, 4096)]       0                                            
__________________________________________________________________________________________________
dense (Dense)                   (None, 300)          1229100     dense_input[0][0]                
__________________________________________________________________________________________________
input_1 (InputLayer)            [(None, None)]       0                                            
__________________________________________________________________________________________________
reshape (Reshape)               (None, 1, 300)       0           dense[0][0]                      
__________________________________________________________________________________________________
embedding (Embedding)           (None, None, 300)    4429500     input_1[0][0]                    
__________________________________________________________________________________________________
concatenate (Concatenate)       (None, None, 300)    0           reshape[0][0]                    
                                                                 embedding[0][0]                  
__________________________________________________________________________________________________
bidirectional (Bidirectional)   (None, 1000)         3204000     concatenate[0][0]                
__________________________________________________________________________________________________
dropout (Dropout)               (None, 1000)         0           bidirectional[0][0]              
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 1000)         1001000     dropout[0][0]                    
==================================================================================================
Total params: 9,863,600
Trainable params: 5,434,100
Non-trainable params: 4,429,500
__________________________________________________________________________________________________
